tap "railwaycat/emacsmacport"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Command-driven, interactive function plotting
brew "gnuplot"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac@29", args: ["with-ctags", "with-dbus", "with-glib", "with-imagemagick", "with-librsvg", "with-mac-metal", "with-modern-icon", "with-native-compilation", "with-no-title-bars", "with-starter", "with-unlimited-select", "with-xwidgets"]
# Application uninstaller
cask "appcleaner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Private rolodex to remember people better
cask "clay"
# Personal CRM that reminds you to keep in touch
cask "dana-dex"
# Voice and text chat software
cask "discord"
# System-wide audio equaliser
cask "eqmac"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# Music streaming service
cask "spotify"
# Native desktop client for WhatsApp
cask "whatsapp"
# Collect, organise, cite, and share research sources
cask "zotero"
