tap "imshuhao/kdeconnect"
tap "jackielii/tap"
tap "railwaycat/emacsmacport"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Configurable static site generator
brew "hugo"
# Alternative to the official immich-CLI command written in Go
brew "immich-go"
# Mac App Store command-line interface
brew "mas"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Simple hotkey daemon for macOS, written in Zig
brew "jackielii/tap/skhd-zig"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac@29", args: ["with-dbus", "with-glib", "with-imagemagick", "with-librsvg", "with-mac-metal", "with-modern-icon", "with-native-compilation", "with-no-title-bars", "with-starter", "with-unlimited-select", "with-xwidgets"]
# Time tracker
cask "activitywatch"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Private rolodex to remember people better
cask "clay"
# Customise menu item keyboard shortcuts
cask "customshortcuts"
# Personal CRM that reminds you to keep in touch
cask "dana-dex"
# Voice and text chat software
cask "discord"
# System-wide audio equaliser
cask "eqmac"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Find shortcuts for any installed application
cask "keyclu"
# Instant shortcut lookup
cask "keycombiner"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Email client
cask "microsoft-outlook"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Free and open-source SoundCloud client
cask "nuage"
# JDK from Oracle
cask "oracle-jdk"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# To-do list and time tracker
cask "super-productivity"
# Customizable email client
cask "thunderbird"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# System tray app for automatic time tracking
cask "wakatime"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "Emotiv", id: 6483688285
mas "Habitify", id: 1111447047
mas "KDE Connect", id: 1580245991
vscode "anthropic.claude-code"
